{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "title_inp", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 100, 50], "input_dtype": "float32", "sparse": false, "name": "title_inp"}, "inbound_nodes": []}, {"name": "descr_inp", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 100, 50], "input_dtype": "float32", "sparse": false, "name": "descr_inp"}, "inbound_nodes": []}, {"name": "lstm_1", "class_name": "LSTM", "config": {"name": "lstm_1", "trainable": true, "batch_input_shape": [null, null, 50], "input_dtype": "float32", "return_sequences": true, "go_backwards": false, "stateful": false, "unroll": false, "consume_less": "cpu", "input_dim": 50, "input_length": null, "output_dim": 50, "init": "glorot_uniform", "inner_init": "orthogonal", "forget_bias_init": "one", "activation": "tanh", "inner_activation": "hard_sigmoid", "W_regularizer": null, "U_regularizer": null, "b_regularizer": null, "dropout_W": 0.2, "dropout_U": 0.2}, "inbound_nodes": [[["title_inp", 0, 0]], [["descr_inp", 0, 0]]]}, {"name": "title_mask", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 100], "input_dtype": "float32", "sparse": false, "name": "title_mask"}, "inbound_nodes": []}, {"name": "descr_mask", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 100], "input_dtype": "float32", "sparse": false, "name": "descr_mask"}, "inbound_nodes": []}, {"name": "poolingseq_1", "class_name": "PoolingSeq", "config": {"name": "poolingseq_1", "trainable": true}, "inbound_nodes": [[["lstm_1", 0, 0], ["title_mask", 0, 0]]]}, {"name": "poolingseq_2", "class_name": "PoolingSeq", "config": {"name": "poolingseq_2", "trainable": true}, "inbound_nodes": [[["lstm_1", 1, 0], ["descr_mask", 0, 0]]]}, {"name": "merge_1", "class_name": "Merge", "config": {"name": "merge_1", "mode": "ave", "mode_type": "raw", "concat_axis": -1, "dot_axes": -1, "output_shape": null, "output_shape_type": "raw", "output_mask": null, "output_mask_type": "raw", "arguments": {}}, "inbound_nodes": [[["poolingseq_1", 0, 0], ["poolingseq_2", 0, 0]]]}, {"name": "dropout_1", "class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.5}, "inbound_nodes": [[["merge_1", 0, 0]]]}, {"name": "highway_1", "class_name": "Highway", "config": {"name": "highway_1", "trainable": true, "init": "glorot_normal", "activation": "relu", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": null}, "inbound_nodes": [[["dropout_1", 0, 0]], [["highway_1", 0, 0]], [["highway_1", 1, 0]], [["highway_1", 2, 0]], [["highway_1", 3, 0]], [["highway_1", 4, 0]], [["highway_1", 5, 0]], [["highway_1", 6, 0]], [["highway_1", 7, 0]], [["highway_1", 8, 0]]]}, {"name": "dropout_2", "class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.5}, "inbound_nodes": [[["highway_1", 9, 0]]]}, {"name": "dense_1", "class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "output_dim": 1, "init": "glorot_uniform", "activation": "linear", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": 50}, "inbound_nodes": [[["dropout_2", 0, 0]]]}], "input_layers": [["title_inp", 0, 0], ["title_mask", 0, 0], ["descr_inp", 0, 0], ["descr_mask", 0, 0]], "output_layers": [["dense_1", 0, 0]]}, "keras_version": "1.2.2"}