{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "main_inp", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 100], "input_dtype": "int64", "sparse": false, "name": "main_inp"}, "inbound_nodes": []}, {"name": "embedding_1", "class_name": "Embedding", "config": {"name": "embedding_1", "trainable": true, "batch_input_shape": [null, 100], "input_dtype": "int32", "input_dim": 5001, "output_dim": 50, "init": "uniform", "input_length": 100, "mask_zero": true, "activity_regularizer": null, "W_regularizer": null, "W_constraint": null, "dropout": 0.0}, "inbound_nodes": [[["main_inp", 0, 0]]]}, {"name": "lstm_1", "class_name": "LSTM", "config": {"name": "lstm_1", "trainable": true, "batch_input_shape": [null, null, 50], "input_dtype": "float32", "return_sequences": true, "go_backwards": false, "stateful": false, "unroll": false, "consume_less": "cpu", "input_dim": 50, "input_length": null, "output_dim": 50, "init": "glorot_uniform", "inner_init": "orthogonal", "forget_bias_init": "one", "activation": "tanh", "inner_activation": "hard_sigmoid", "W_regularizer": null, "U_regularizer": null, "b_regularizer": null, "dropout_W": 0.0, "dropout_U": 0.0}, "inbound_nodes": [[["embedding_1", 0, 0]]]}, {"name": "next_inp", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 100], "input_dtype": "int64", "sparse": false, "name": "next_inp"}, "inbound_nodes": []}, {"name": "nce_seq_1", "class_name": "NCE_seq", "config": {"name": "nce_seq_1", "trainable": true, "batch_input_shape": [null, 50], "input_dtype": "float32", "init": "glorot_uniform", "activation": "linear", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": 50, "vocab_size": 5001, "n_noise": 100}, "inbound_nodes": [[["lstm_1", 0, 0], ["next_inp", 0, 0]]]}], "input_layers": [["main_inp", 0, 0], ["next_inp", 0, 0]], "output_layers": [["nce_seq_1", 0, 0]]}, "keras_version": "1.2.2"}